# MYSQL DATABASE

- select: select (*, or any specific column)
- from: table
- where: condition
- left: take left parameter. Left(column,number)
- right: take right parameter. right(column, number)
- order by: sort the return queue by
- group by: group the return value by
- regexp: regular expression
- asc: ascending order
- desc: descending order:
    * Note in a multiple condition that require sort, please use the "order by", instead of "where"
- round: round to a specific number
- sqrt: return square root of a selected single value. Ex: sqrt(number)
- power: return the power of a single number. Ex: power(number,2)
- max: return the maximum of a number in a list. Ex: max(list)
- min: return the minimun of a number in a list. Ex: min(list)
- substring: return the substring of a string. Ex: substring(string, start, end)
- concat: concat all string together. concat('a','b',...,'n')
- upper: string to upper or lower case. upper(string)
- lower: string to lower case
- CASE
    * WHEN condition1 THEN result1
    * WHEN condition2 THEN result2
    * WHEN conditionN THEN resultN
    * ELSE result
    * END;
- set @r1 -> after go to the statement: @r1:=@r1+1
- count: retutn the count of a column
- sum: the sum of all specific value. example: select sum(population) from city where district = 'California';
- ceil: convert to full integer (round it up)
- floor: round it down
- decimal(p,d): The DECIMAL(P,D) means that the column can store up to P digits with D decimals. The actual range of the decimal column depends on the precision and scale.
- between 38.7880 and 137.2345: between 2 numbers.
- in: pass to test the argument in a list

SQL Incremental design.

##### Query the NAME field for all American cities in the CITY table with populations larger than 120000. The CountryCode for America is USA.
SELECT NAME FROM CITY WHERE CITY.POPULATION > 120000 AND CITY.COUNTRYCODE="USA"

##### Query all columns (attributes) for every row in the CITY table.
SELECT * FROM CITY;

##### Query all columns for a city in CITY with the ID 1661.
SELECT * FROM CITY WHERE CITY.ID = 1661;

SELECT * FROM CITY WHERE CITY.COUNTRYCODE = 'JPN';

##### Query a list of CITY names from STATION for cities that have an even ID number. Print the results in any order, but exclude duplicates from the answer.

SELECT CITY FROM STATION WHERE MOD(ID, 2) = 0  GROUP BY CITY;

##### Find the difference between the total number of CITY entries in the table and the number of distinct CITY entries in the table.
SELECT (COUNT(CITY) - COUNT(DISTINCT CITY)) FROM STATION;


##### Query the two cities in STATION with the shortest and longest CITY names, as well as their respective lengths (i.e.: number of characters in the name). If there is more than one smallest or largest city, choose the one that comes first when ordered alphabetically.
select city, length(city) from station order by length(city),city asc limit 1;
select city, length(city) from station order by length(city),city desc limit 1;

##### Query the list of CITY names from STATION that do not start with vowels and do not end with vowels. Your result cannot contain duplicates.
select distinct city from station where city not regexp '^[aeiou]' and city not regexp '[aeiou]$';

##### Write a query that prints a list of employee names (i.e.: the name attribute) from the Employee table in alphabetical order.
select name from employee order by name asc;
order by: give an order list

##### Write a query that prints a list of employee names (i.e.: the name attribute) for employees in Employee having a salary greater than  per month who have been employees for less than  months. Sort your result by ascending employee_id.
select name from employee where salary > 2000 and months < 10 order by employee_id asc;

##### Query the Western Longitude (LONG_W)where the smallest Northern Latitude (LAT_N) in STATION is greater than . Round your answer to  decimal places.
1: select round(long_w,4) from station where lat_n>38.7780 order by lat_n asc limit 1;
2: select round(long_w,4) from station where lat_n=(select min(lat_n) from station where lat_n>38.7780); (suppose to be faster)

##### Consider  and  to be two points on a 2D plane.
 happens to equal the minimum value in Northern Latitude (LAT_N in STATION).
 happens to equal the minimum value in Western Longitude (LONG_W in STATION).
 happens to equal the maximum value in Northern Latitude (LAT_N in STATION).
 happens to equal the maximum value in Western Longitude (LONG_W in STATION).
Query the Manhattan Distance between points  and  and round it to a scale of  decimal places.

SELECT ROUND( MAX(lat_n)-MIN(lat_n) + MAX(long_w)-MIN(long_w), 4) FROM Station;

##### Generate the following two result sets:

Query an alphabetically ordered list of all names in OCCUPATIONS, immediately followed by the first letter of each profession as a parenthetical (i.e.: enclosed in parentheses). For example: AnActorName(A), ADoctorName(D), AProfessorName(P), and ASingerName(S).
Query the number of ocurrences of each occupation in OCCUPATIONS. Sort the occurrences in ascending order, and output them in the following format:

There are a total of [occupation_count] [occupation]s.
where [occupation_count] is the number of occurrences of an occupation in OCCUPATIONS and [occupation] is the lowercase occupation name. If more than one Occupation has the same [occupation_count], they should be ordered alphabetically.

select concat(name,'(',left(occupation,1),')') from occupations order by name;
select concat('There are a total of ',count(name),' ', lower(occupation),'s.') as total from occupations group by occupation order by total;

##### select employee.months*employee.salary as earning, count(*) from employee group by 1 order by earning desc limit 1;

##### select round(max(lat_n),4) from station where lat_n < 137.2345;

##### Query the Western Longitude (LONG_W) for the largest Northern Latitude (LAT_N) in STATION that is less than . Round your answer to  decimal places.
select round(long_w,4) from station where lat_n = (select max(lat_n) from station where lat_n<137.2345);

##### Given the CITY and COUNTRY tables, query the sum of the populations of all cities where the CONTINENT is 'Asia'.
select sum(population) from city where countrycode in (select code from country where continent= 'Asia');

##### Given the CITY and COUNTRY tables, query the names of all the continents (COUNTRY.Continent) and their respective average city populations (CITY.Population) rounded down to the nearest integer.
/*
select continent from country group by continent;
select count(code) from country group by continent;
*/
select country.continent, 
    floor(avg(city.population)) 
    from city inner join country on city.countrycode = country.code 
    group by country.continent;
    
##### no join, find the value between
Ketty gives Eve a task to generate a report containing three columns: Name, Grade and Mark. Ketty doesn't want the NAMES of those students who received a grade lower than 8. The report must be in descending order by grade -- i.e. higher grades are entered first. If there is more than one student with the same grade (8-10) assigned to them, order those particular students by their name alphabetically. Finally, if the grade is lower than 8, use "NULL" as their name and list them by their grades in descending order. If there is more than one student with the same grade (1-7) assigned to them, order those particular students by their marks in ascending order.

select case
    when grades.grade < 8 then "NULL"
    else students.name end, grades.grade, students.marks 
    from grades, students 
    where students.marks between grades.min_mark and grades.max_mark 
    order by grades.grade desc, students.name asc ;
Write a query to help Eve.
set @number = 21;

##### select repeat('* ', @number := @number - 1) from information_schema.tables;

In [1]:
mydict = {"cat":12, "dog":6, 
          "elephant":23, "bear":20}

keylist = list(mydict.keys())

In [14]:
mydict["mouse"] = mydict.get("cat") + mydict.get("dog")

print(mydict.get("mouse"))

18

In [15]:
import numpy as np
a = np.array([5, 9, -3, 12, 1, 6.14])
b = np.arange(6, dtype=float)

In [27]:
c = np.array( [ [4, 5, 6], [1, 2, 3] ] )
d = np.array( [ [6, 2, -3], [14, -1, 6] ] )